{"name":"DOUGLAS 31/32","images":[{"alt":"Douglas 32 drawing on sailboatdata.com","src":"imagehelper.asp?file_id=8664","type":"drawing"}],"basics":{"hullType":"Long Keel","rigType":"Masthead Sloop","loa":{"feet":32.09,"meters":9.78},"lwl":{"feet":24.5,"meters":7.47},"beam":{"feet":9.5,"meters":2.9},"listedSa":{"feet":459,"meters":42.64},"draftMax":{"feet":4.67,"meters":1.42},"draftMin":null,"displacement":5216,"ballast":null,"sailAreaDisp1":14.46,"balDisp":null,"dispLen":349.1,"designer":"Ted Brewer","builder":"Douglas Marine Craft (CAN)","construction":"FG","balType":null,"firstBuilt":"1967","lastBuilt":"1982","numBuilt":null},"rigSail":{"i_ig":{"feet":37.5,"meters":11.43},"j":{"feet":12.7,"meters":3.87},"p":{"feet":32,"meters":9.75},"e":{"feet":13.8,"meters":4.21},"py":null,"ey":null,"isp":null,"spl_tps":null,"saFore":{"feet":238.13,"meters":22.12},"saMain":{"feet":220.8,"meters":20.51},"sailArea":{"feet":458.93,"meters":42.63},"sailAreaDisp2":14.46,"estForestayLength":{"feet":39.59,"meters":12.07}},"buildersPastPresent":[{"href":"view_builder.asp?builder_id=73","title":"Hinterhoeller Yachts Ltd."}],"designer":[{"href":"view_designer.asp?designer_id=78","title":"Edward S. Brewer"}],"seeAlso":{"relatedBoat":{"href":"viewrecord.asp?class_id=1114","title":"HULLMASTER 31"}},"notes":"DOUGLAS 32 is like 31 with extended reverse transom.\r\nSimilar to HULLMASTER 31, ALCONA 31.\r\nHISTORY:\r\nDOUGLAS MARINE CRAFT - Douglas Badgley commissioned Ted Brewer to design the original Douglas 31s. His company, Douglas Marine Craft, built them in Port Stanley, Ontario, starting in 1967. Around 1970-1971 Douglas Yachts went out of business, and the molds were reportedly seized by creditors.\r\n\r\nNORTH AMERICAN FIBREGLAS MOULDINGS - Jeffrey White of North American Fiberglas Moldings Ltd. in London, Ontario acquired at least one set of DOUGLAS 31 hull and deck molds, and modified them with a reverse transom designed by Ted Brewer to create the DOUGLAS 32.(shown here) \r\n\r\nCOMMAND YACHTS - In 1974, North American Fiberglas went into receivership and emerged as Command Yachts with the same crew and president, and a new model - The D-32 MKII. Command Yachts was purchased by De Leuw Cather Canada who dissolved the boat building division around 1976. \r\n\r\nBRUCE PENINSULA YACHTS - Apparently, the D-32 molds were then acquired by Bruce Peninsula Yachts, who produced DOUGLAS 32 MK IIs in Port Elgin, Ontario, featuring a different cabin configuration.\r\n\r\nHULLMASTER BOATS, LTD. - Hullmaster Boats, LTD acquired one or more of the original Douglas 31 molds about the same time as North American Fibreglas Mouldings, and concurrently built HULLMASTER 31s in Picton, Ontario. The last HULLMASTER 31 was built in 1979. \r\n\r\nTHE FIRST \"KIT\" BOATS- When Hullmaster went out of business, Doug Smith acquired the Douglas 31 molds and produced kits for owner finishing. \r\n\r\nJ&C FIBERCRAFT - It has been said that Doug Smith sold his business to Jed & Carol Benoit of J&C Fibercraft. It appears that J&C D-31s are direct descendants of Hullmaster. Either way, custom yachts of a high quality as well as kit boats from the D-31 molds were built by this company in Barrie, Ontario. \r\n\r\nHINTERHOELLER - It is believed that the last six D-31 hulls were built and delivered as kit boats by Hinterhoeller Yachts out of Ontario around 1982.\r\n\r\nThanks to Richard for providing corrections."}
